IDEA StatiCa Open Model
TemperatureCurve2D.Temperature Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 The temperature [K]
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Temperature { get; set; }
Public Property Temperature As Double
	Get
	Set
public:
property double Temperature {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
TemperatureCurve2D Class
IdeaRS.OpenModel.Geometry2D Namespace